---
layout: center
---

## Prolog


---
---

> Get the last element of a list.

```prolog
last_member(X, [X]).
last_member(X, [_|TAIL]) :- last_member(X, TAIL).
```

```prolog
?- consult("list.pl").
true.

?- last_member(X, [1, 2, 3, 4, 5]).
X = 5 .

?- last_member(X, [44, -2, 33, 12]).
X = 12 .

?- last_member(X, [44, 33, 12, -2]).
X = -2 .
```

---
---

> Count the number of elements in the list.

```prolog
list_length(0, []).
list_length(N, [_|TAIL]) :- list_length(N1, TAIL), N is N1 + 1.
```

```prolog
?- consult("list.pl").
true.

?- list_length(X, [1, 2, 3, 4, 5]).
X = 5.

?- list_length(X, [5, 4, 3, 2, 1]).
X = 5.

?- list_length(X, [5, 4, 3, 2, 1, 6, 7, 8]).
X = 8.

?- list_length(X, []).
X = 0.
```

---
---

> Verify if an element is part of a list using the predicate `member`

```prolog
member(X, [X|_]).
member(X, [_|TAIL]) :- member(X, TAIL).
```

```prolog
?- consult("list.pl").
true.

?- member(5, [1, 2, 3, 4]).
false.

?- member(5, [1, 2, 3, 4, 5]).
true .

?- member(5, [1, -2, 5, -4, 12]).
true .
```

---
---

> Define another list `[a, b, c, d, b]` and concat it with the previous one
> `[1, 2, 3, 4, 5, 6]` using the predicate `append`.

```prolog
append([], L, L).
append([X1|L1], L2, [X1|L3]) :- append(L1, L2, L3).
```

```prolog
?- consult("list.pl").
true.

?- append([], [4, 5, 6], Result).
Result = [4, 5, 6].

?- append([1, 2, 3, 4, 5, 6], [a, b, c, d, b], Result).
Result = [1, 2, 3, 4, 5, 6, a, b, c|...].

?- append([1, 2, 3, 4, 5, 6], [a, b, c, d], Result).
Result = [1, 2, 3, 4, 5, 6, a, b, c|...].

?- append([1, 2, 3, 4, 5, 6], [a, b, c], Result).
Result = [1, 2, 3, 4, 5, 6, a, b, c].
```

---
---

> Given the list `[1, 2, 3, 4, 5, 6]`, insert `7` as the last element into the list.

```prolog
append([], L, L).
append([X1|L1], L2, [X1|L3]) :- append(L1, L2, L3).

insert_last(APPEND, LIST, RESULT) :- append(LIST, [APPEND], RESULT).
```

```prolog
?- consult("list.pl").
true.

?- insert_last(7, [1, 2, 3, 4, 5, 6], Result).
Result = [1, 2, 3, 4, 5, 6, 7].

?- insert_last(7, [1, 2, 3, 4, 5, 6, 7], Result).
Result = [1, 2, 3, 4, 5, 6, 7, 7].
```

---
---

> The following two Prolog tasks are all implemented with this graph knowledge base as a basis:

```prolog
vertex('A1').
vertex('A2').
vertex('A3').
vertex('A4').

hasDescription('A1', 'Event 1').
hasDescription('A2', 'Event 2').
hasDescription('A3', 'Event 3').
hasDescription('A3', 'Event 4').

hasActor('A1', 'Actor 1').
hasActor('A2', 'Actor 2').
hasActor('A3', 'Actor 3').
hasActor('A4', 'Actor 4').

hasOccurrenceVertex('A1', 4).
hasOccurrenceVertex('A2', 11).
hasOccurrenceVertex('A3', 2).
hasOccurrenceVertex('A4', 2).

edge('A1', 'A2', 5).
edge('A2', 'A3', 1).
edge('A3', 'A1', 1).
```

---
---

> Construct and test a functor `node` of the type: `node('Event', 'Description', 'Actor', 'Occurence')`.
>
> E.g. `?- node('A1', 'Event 1', 'Actor 1', 4).`

```prolog
node(Name, Event, Actor, Occ) :-  vertex(Name),
                                  hasDescription(Name, Event),
                                  hasActor(Name, Actor),
                                  hasOccurrenceVertex(Name, Occ).
```

```prolog
?- consult("graph.pl").
true.

?- node('A1', 'Event 1', 'Actor 1', 4).
true.

?- node(A, 'Event 1', Y, X).
A = 'A1',
Y = 'Actor 1',
X = 4 .

?- node(A, Event, Actor, 2).
A = 'A3',
Event = 'Event 3',
Actor = 'Actor 3' ;
A = 'A3',
Event = 'Event 4',
Actor = 'Actor 3' .
```

---
---

> Construct and test a functor `arc` of the type: `arc('Node 1', 'Node 2', 'Edge Occurence')`,
> where 'Node 1' and 'Node 2' each represent the functors 'node'.
>
> E.g. `?- edge(node('A1', 'Event 1', 'Actor 1', 4), node('A2', 'Event 2', 'Actor 2', 11), 5).`

```prolog
edge(node(Name1, _, _, _), node(Name2, _, _, _), EdgeOcc)
  :- edge(Name1, Name2, EdgeOcc).
edge(node(Name1, _, _, _), node(Name2, _, _, _), EdgeOcc)
  :- edge(Name2, Name1, EdgeOcc).
```

```prolog
?- consult("graph.pl").
true.

?- edge(node('A1', 'Event 1', 'Actor 1', 4), node('A2', 'Event 2', 'Actor 2', 11), 5).
true .

?- edge(node('A3', 'Event 1', 'Actor 1', 4), node('A1', 'Event 2', 'Actor 2', 11), 1).
true .

?- edge(node('A1', 'Event 1', 'Actor 1', 4), node('A3', 'Event 2', 'Actor 2', 11), 1).
true.

?- edge(node('A1', 'Event 1', 'Actor 1', 4), node('A2', 'Event 2', 'Actor 2', 11), 12).
false.
```
